<template>
    <section id="calculators">
        <h2 class="text-center text-4xl mb-1 ">حاسبات قيدها</h2>
        <p class="text-center text-xl mb-5 text-gray-700">اختر العبة اللى تريدها وحنا نقيدها</p>

        <div class="grid justify-center items-center grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-5 px-5">
            <UCard class=" text-white" :ui="{
                base: 'inline shadow-lg',
                background: 'bg-white dark:bg-white',
                ring: 'ring-0'
            }">
                <img src="@/assets/images/hand.svg" class="h-20 w-20 " alt="hand">
                <h3 class="text-xl mb-3 text-[#1d2145]"> حاسبة هاند </h3>
                <p class="text-xs text-gray-400 leading-5">

                <p>عدد الورق (52 ورقة)</p>
                <p>عدد اللاعبين 2 إلى 5 لاعب</p>
                <p> طريقة اللعبة:</p>
                <ul class="list-decimal ms-5">
                    <li>
                        تكوين مجموعات من الأوراق (تسلسلات أو مجموعات من نفس القيمة) لإنهاء يدك بأسرع وقت ممكن
                    </li>

                    <li>
                        تتم اللعبة على عدة جولات
                    </li>

                    <li>
                        يسعى اللاعبون لتقليل مجموع نقاطهم، إذ أن الأوراق المتبقية في يد اللاعب تحتسب كنقاط سلبية عند
                        الجولة انتهاء
                    </li>
                    <li>
                        الفائز باللعبة الذي يجمع أقل عدد من النقاط بعد عدد محدد من الجولات.
                    </li>

                </ul>


                <!-- 
                    الهاند هي لعبة ورقية تُلعب بشكل شائع في منطقة الشرق الأوسط، تتطلب مهارة واستراتيجية. تُلعب باستخدام
                    مجموعة أوراق لعب كاملة (52 ورقة)، ويشارك فيها عادة من 2 إلى 5 لاعبين. تهدف اللعبة إلى تكوين مجموعات
                    من الأوراق (تسلسلات أو مجموعات من نفس القيمة) لإنهاء يدك بأسرع وقت ممكن. تتم اللعبة على عدة جولات،
                    حيث يسعى اللاعبون لتقليل مجموع نقاطهم، إذ أن الأوراق المتبقية في يد اللاعب تحتسب كنقاط سلبية عند
                    انتهاء الجولة. يفوز باللعبة اللاعب الذي يجمع أقل عدد من النقاط بعد عدد محدد من الجولات. -->
                </p>
            </UCard>
            <UCard class=" text-white" :ui="{
                base: 'inline shadow-lg',
                background: 'bg-[#1d2145] dark:bg-[#1d2145] ',
                ring: 'ring-0'

            }">
                <img src="@/assets/images/baloot.svg" class="h-20 w-20 " alt="baloot">
                <h3 class="text-xl mb-3 ">حاسبة بلوت </h3>
                <div class="text-xs text-gray-400 leading-5">

                    <p>
                        عدد الورق: (32 ورقة)
                    </p>
                    <p>عدد اللاعبين: 4 لاعبين</p>
                    <p> عدد الفرق: فريقين (كل فريق لاعبين)
                    </p>
                    <p>
                        طريقة اللعبة:
                    </p>
                    <ul class="ms-5 list-decimal">
                        <li>
                            عدة جولات
                        </li>
                        <li>
                            الفائز الذي جمع عدد نقاط من الجولات بناء على ورق اللعب
                        </li>
                    </ul>
                </div>

                <!-- <p class="text-xs text-gray-400 leading-5">
                    البلوت هي لعبة ورقية شعبية تُلعب بشكل رئيسي في دول الخليج العربي، خاصة في السعودية. تُلعب البلوت
                    باستخدام مجموعة من 32 ورقة لعب (تُستبعد الأوراق من 2 إلى 6). يُشترك فيها أربعة لاعبين في فريقين، كل
                    فريق يتكون من شخصين يجلسان بشكل متقابل. تعتمد اللعبة على الاستراتيجية والتكتيك، وتتضمن معرفة قواعد
                    خاصة بالترتيب والقيمة للأوراق، مثل الشراكة، والطلب (التعهد بلعب نوع معين من الورق)، واللعب في
                    الطرنيب أو الصن. تهدف الفرق إلى جمع أكبر عدد من النقاط من خلال الفوز بالجولات، التي تُحسب بناءً على
                    الأوراق التي يتم لعبها.
                </p> -->
            </UCard>
            <UCard class=" text-white" :ui="{
                base: 'inline shadow-lg',
                background: 'bg-white dark:bg-white',
                ring: 'ring-0'

            }">
                <img src="@/assets/images/trex.svg" class="h-20 w-32 " alt="trex">
                <h3 class="text-xl mb-3 text-[#1d2145]">حاسبة تريكس
                    <UBadge color="amber">قريبا</UBadge>
                </h3>
                <p class="text-xs text-gray-400 leading-5">
                <p>عدد اللاعبين: 4 لاعبين</p>
                <p>طريقة اللعبة:</p>
                <ul class="ms-5 list-decimal">
                    <li> خمس ألعاب مختلفة تُلعب على مدار أربع جولات</li>
                    <li>
                        الألعاب الخمس بالترتيب هي: "التريكس"، "الملكة"، "اللطوش"، "الديناري"، و"الكبوش"
                        في كل جولة يتم تعيين "ملك" (اللاعب الذي يختار ترتيب الألعاب)
                    </li>
                </ul>


                <!-- التريكس هي لعبة ورقية شهيرة في العالم العربي، تُلعب عادة بين أربعة
                    لاعبين. تتألف اللعبة من خمس ألعاب مختلفة تُلعب على مدار أربع جولات، وفي كل جولة يتم تعيين "ملك"
                    (اللاعب الذي يختار الترتيب) لتحديد ترتيب الألعاب. الألعاب الخمس هي: "التريكس"، "الملكة"، "اللطوش"،
                    "الديناري"، و"الكبوش". تهدف كل لعبة إلى تجنب جمع بطاقات معينة أو تحقيق أهداف معينة لتحقيق أقل نقاط
                    سلبية ممكنة. تعتبر التريكس لعبة تعتمد على الاستراتيجية والتخطيط، وتتطلب تفكيرًا دقيقًا وتعاونًا بين
                    اللاعبين. -->
                </p>
            </UCard>
        </div>

    </section>
</template>

<script setup lang="ts">

</script>

<style></style>