<template>
    <div class="text-center py-5">
        <div v-for="d in data" class="mt-5">
            <h2 class="text-2xl">{{ d.title }}</h2>
            <p class="mt-2 px-10">{{ d.description }}</p>
        </div>
    </div>
</template>

<script setup lang="ts">
let data = [
    {
        title: "سياسة الخصوصية لتطبيق قيدها", description: "نؤكد لك أن خصوصيتك على رأس أولوياتنا، ونحن ملتزمون بحمايتها بكل الوسائل الممكنة من خلال الدخول إلى تطبيق أو موقع قيدها، فإنك توافق على الالتزام بهذه الشروط والسياسات وجميع القوانين واللوائح المعمول بها في المملكة العربية السعودية. وتُقر أيضا بأنك تتحمل المسؤولية عن الامتثال لأي قوانين محلية معمول بها، ولا يحق لك استخدام أو الوصول إلى التطبيق أو الموقع الالكتروني في حالة عدم موافقتك على أي من هذه الشروط والسياسات."
    },
    {
        title: "جمع واستخدام المعلومات", description: "أثناء استخدامك للتطبيق أو موقعنا الإلكتروني، قد نطلب منك إمدادنا بمعلوماتك الشخصية حتى نتمكن من التواصل معك. وقد تتضمن هذه المعلومات على سبيل المثال لا الحصر (عنوان بريدك الإلكتروني واسمك ورقم جوالك وموقعك وأية معلومات أخرى مطلوبة للتواصل معك عبر الإنترنت أو عبر الهاتف. ويجوز لنا توظيف شركات وأفراد أو كلاهما لتسهيل خدمتنا والمشاركة في تلبية طلبك واستخدام الخدمات المتعلقة بتطبيقنا ولمساعدتنا في تحليل كيفية استخدامك لتطبيقنا وموقعنا الإلكتروني ويُحق لهذه الأطراف الوصول إلى معلوماتك الشخصية فقط لتنفيذ هذه المهام نيابة عنا وتكون ملزمة بعدم الإفصاح عنها أو استخدامها لأي غرض آخر."
    },
    { title: "وسائل الاتصال", description: "قد نستخدم معلوماتك الشخصية للتواصل معك من خلال النشرات الإخبارية والمواد التسويقية أو الترويجية وغيرها من المعلومات التي قد تهمك. ويمكنك اختيار عدم تلقي أي من وسائل الاتصال هذه أو جميعها باتباع رابط إلغاء الاشتراك أو التعليمات الموجودة في أي بريد إلكتروني يُرسل إليك. نحن لا تبيع أو نؤجر معلوماتك الشخصية للغير لأغراض التسويق دون الحصول على موافقتك الصريحة. قد تجمع معلوماتك من الشركات المتخصصة لاستخدامها في تحسين وتخصيص خدماتنا ومحتوانا وإعلاناتنا" },
    { title: "السرية", description: "يقع على عاتقك مسؤولية الحفاظ على سرية بيانات حسابك وكلمة المرور الخاصة بك وتحديد من يصل إلى أجهزتك أو تطبيقنا أو موقعنا الإلكتروني، وتوافق على قبول المسؤولية عن جميع الأنشطة التي تحدث تحت حسابك أو كلمة المرور الخاصة بك وإخطارنا في حالة حدوث أي عمليات غير مصرح بها تتم من خلال حسابك." },
    { title: "الأمن وحماية المعلومات", description: "نحن نتبع الإجراءات المناسبة ومعايير الأمان في جمع البيانات وحفظها ومعالجتها لحماية تلك البيانات من المعالجة أو الإفصاح غير المصرح بها أو في حالات التعديل أو إتلاف بياناتك الشخصية واسم المستخدم وكلمة المرور ومعلومات حول معاملاتك والبيانات المخزنة على تطبيقنا أو موقعنا الإلكتروني ونسعى جاهدين لاستخدام وسائل مقبولة تجاريًا لحماية معلوماتك الشخصية ومع ذلك، لا يمكننا ضمان أمنها المطلق. ويمكنك ملاحظة أنه يتم تبادل البيانات الحساسة والخاصة بين تطبيقنا أو موقعنا الإلكتروني ومستخدميه ويكون ذلك من خلال قنوات اتصال آمنة ويتم تشفيرها وحمايتها بالطرق والأساليب الرقمية المعتمدة." },
    {
        title: "مشاركة البيانات الشخصية", description: "نحن لا نبيع أو نتاجر أو نؤجر بيانات الهوية الشخصية المتعلقة بالمستخدمين للغير قد نشارك معلومات ديموغرافية مجمعة عامة غير مرتبطة بأي معلومات محددة للهوية عن الزوار والمستخدمين مع شركائنا والشركات التابعة لنا والمعلنين للأغراض الموضحة أعلاه. وقد نستخدم موفر خدمة تابعًا للغير لمساعدتنا في إدارة أعمالنا وتشغيل التطبيق والموقع الإلكتروني أو لإدارة الأنشطة نيابة عنا مثل إرسال الرسائل الإخبارية أو الاستبيانات ويجوز لنا مشاركة بياناتك مع الغير في حدود تلك الأغراض المحددة."
    },
    {
        title: "الامتثال للأنظمة والقوانين", description: "ستفصح عن معلوماتك الشخصية - دون الحصول على موافقتك المسبقة - إذا كان ذلك مطلوبًا أو مسموحًا به بموجب القانون أو أمر محكمة أو أي كيان حكومي مفوض وفقًا للوائح، نؤكد لك أننا لا نشارك بياناتك مع أي هيئة رسمية حكومية إلا بخطاب رسمي موجه ويجوز لشركتنا الإفصاح عن بياناتك شخصيا في القضايا الأمنية أو الجنائية، أو إذا كنا نعتقد أن مثل هذا الإجراء ضروري لإنفاذ القانون أو لتلبية طلب معقول بموجب القانون أو لحماية أمن وسلامة الخدمة والتطبيق وموقعنا الإلكتروني، أو لحماية حقوق الملكية لتطبيقنا وموقعنا الإلكتروني أو يكون الأمر ضروري لتقديم الخدمات أو المنتجات أو لتقديم الدعم الفني لعملائنا."
    },
    {
        title: "حفظ المعلومات الشخصية", description: "في حالة إنهاء علاقتنا معك، سنحتفظ بمعلوماتك الشخصية لمدة خمس سنوات ثم نحذفها بطريقة آمنة. إذا كنت ترغب في حذف معلوماتك مسبقا، يمكنك التواصل معنا."
    },
    {
        title: "تصفح البيانات وتدفقها", description: "اثناء تصفحك لتطبيقنا أو موقعنا الإلكتروني تجمع بيانات التصفح وتدفقات البيانات التي توضح الصفحات التي قمت بزيارتها على التطبيق أو الموقع، ونوع الميزات التي استخدمتها ومدة زيارتك لصفحة معينة، وما إلى ذلك. لن تحدد هذه المعلومات هويتك ولن ترتبط بك شخصيا. ونستخدم هذه المعلومات لإكمال ودعم وتحليل مشترياتك معنا لتسهيل وتحسين استخدامك للتطبيق والموقع الإلكتروني، للامتثال لأي متطلبات قانونية، ولتوفير أو تمكين الغير من إمدادك بمحتوى إعلاني مخصص ذي صلة أو توصيات حول التطبيق وموقنا الإلكتروني أو موقع ويب تابع للغير أو لأغراض داخلية."
    },
    { title: "أطراف خارجية", description: "قد يجد المستخدمون إعلانات أو محتوى آخر على تطبيقنا أو موقعنا الإلكتروني يحتوي على روابط لمواقع وخدمات لشركائنا أو موردينا أو المعلنين أو الرعاة أو المرخصين أو كيانات أخرى تابعة للغير. ويتعين علينا ملاحظة أننا لا نتحكم في المحتوى أو الروابط التي تظهر على تلك المواقع ولا نتحمل المسؤولية عن ممارسات المواقع المرتبطة بتطبيقنا أو موقعنا الإلكتروني. بالإضافة إلى ذلك، فإن تلك المواقع أو الخدمات، بما في ذلك محتواها وروابطها قد تتغير باستمرار. وسيكون لهذه المواقع والخدمات سياسات الخصوصية الخاصة بها وسياسات خدمة العملاء. ويخضع التصفح والتفاعل على أي موقع ويب آخر، بما في ذلك مواقع الويب التي ترتبط بتطبيقنا أو موقعنا الإلكتروني لشروط وسياسات تلك المواقع الإلكترونية. قد نتعاون مع الغير من مزودي الخدمة للمساعدة في بعض ميزات مواقع الويب. وستُقدم بياناتك الشخصية إلى مزود الخدمة نيابة عنا ولن يُسمح باستخدامها لأي غرض آخر. ويمكننا إيقاف تشغيل النظام مؤقتا أو إيقافه تماما في أي وقت. لن نتحمل أي مسؤوليات تجاه المستخدمين أو الغير بسبب التعليق المؤقت أو الكامل لتشغيل النظام. " },
    {
        title: "التغييرات في سياسة الخصوصية", description: "يحق لنا تعديل أو تحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. وستنشر أية تغييرات أو تعديلات على هذه الصفحة وننصحك بمراجعة سياسة الخصوصية بشكل دوري لمعرفة أي تحديثات ؛ وستصبح هذه التغييرات سارية فور نشرها على هذه الصفحة."
    },
    { title: "تواصل معنا", description: "إذا كانت لديك أية استفسارات حول سياسة الخصوصية هذه. فيرجى التواصل معنا" },
]

</script>

<style scoped></style>