<template>
    <div class=" py-5  px-10">
        <div v-for="d in data" class="mt-5">
            <h2 class="text-4xl">{{ d.title }}</h2>
            <p class="mt-5">{{ d.description }}</p>
        </div>
        <div class="mt-5">
            <h2 class="text-2xl">{{ terms.title }}</h2>
            <ul class="mt-2 px-5 list-disc">
                <li v-for="term in terms.terms" class="text-md my-2">
                    {{ term }}
                </li>
            </ul>
        </div>
    </div>
</template>

<script setup lang="ts">
let data = [
    {
        title: "الشروط والأحكام", description: "تطبق الشروط والأحكام على تطبيق قيدها ومتجرها، ومواقعها، والخدمات ذات الصلة، والتي نطلق عليها هنا إجمالاً «الخدمة». قد نُحدث الشروط والأحكام هذه دوريًا لتلبية المعايير والمتطلبات المعمول بها. لذا، نحن نحث دائما مستخدمي قيدها على زيارة هذا المخصص بشكل مستمر علما بأن التحديثات ستصبح فاعلة بشكل .مباشر في نفس اليوم التي تُنشر به"
    }
]
let terms = {
    title: "يعد استخدامك لقيدها و إنشاء حساب عليه موافقة على الشروط و النقاط التالية",
    terms: [" لا يجوز للعملاء الذين تقل أعمارهم عن 18 عامًا التسجيل كمستخدم للموقع ولا يجوز لهم التعامل أو استخدام الموقع",
        " باستخدام تطبيق قيدها فأنت توافق على عدم نشر أي مواد مسيئة أو فاحشة أو مبتذلة أو بغيضة أو تهديدية أو ذات توجه جنسي أو أي مواد أخرى قد تنتهك أي قوانين معمول بها"
        ,
        "باستخدام تطبيق قيدها فأنت توافق على عدم نشر أي روابط أو مواد قد تؤدي إلى تعطيل الخدمة للاعبين الآخرين (كجميع أنواع الفيروسات والبرامج النصية الضّارة وصفحات التصيُّد وما إلى ذلك)"
        ,
        " باستخدام تطبيق قيدها فأنت توافق على عدم محاولة الدخول غير المصرح به إلى الموقع أو أي من الحسابات المسجلة لآخرين أو إلى أجهزة الكمبيوتر أو الخوادم أو الشبكات المتصلة بتطبيق جواكر بأي وسيلة بخلاف واجهة المستخدم التي يوفرها تطبيق قيدها"
        ,
        " باستخدام تطبيق قيدها فأنت توافق على عدم الاستفادة من أي ثغرات للتحايل على النظام"
        ,
        " باستخدام تطبيق قيدها ستكون مسؤولاً عن أي نشاط يخرج من حسابك"
        ,
        "باستخدام تطبيق قيدها أنت مسؤول عن الحفاظ على سرية معلومات تسجيل الدخول الخاصة بك، والحرص على عدم تمكن أي مستخدم آخر من الوصول إلى حسابك. في حال تم تسجيل الدخول إلى حسابك بطريقة غير مشروعة، يجب عليك إعلام تطبيق قيدها على الفور"
        ,
        " باستخدام تطبيق قيدها فأنت توافق على عدم انتحال أي شخصية عامة و / أو حكومية أو مشهورة أو أي شخصية لاعب آخر على تطبيق قيدها"
        ,
        "باستخدام تطبيق قيدها فأنت توافق على عدم تضليل اللاعبين الآخرين زوراً للاعتقاد بأنك جزء من إدارة التطبيق، أو مشرفاً، أو أي شخص يعمل رسمياً في تطبيق قيدها"
        ,
        "باستخدام تطبيق قيدها فأنت توافق على عدم استخدام التطبيق لإنشاء أي منظمات سياسية أو دينية، أو تنظيم مسيرات سلمية أو غير سلمية، أو التحريض ضد مجموعة معينة من الناس"
        ,
        "باستخدام تطبيق قيدها فأنت توافق على احترام المستخدمين الآخرين وعدم محاولة فرض أي آراء شخصية عليهم"
        ,
        " باستخدام تطبيق قيدها فأنت توافق على عدم إهانة المشرفين أو الإساءة إليهم أو مهاجمتهم بأي طريقة كانت أثناء عملهم. وننصحك بإرسال بريد إلكتروني إلى قيدها للإبلاغ عن أي شكاوى تتعلق بهم"
        ,
        "باستخدام تطبيق قيدها فأنت توافق على عدم إرسال بريد عشوائي للمستخدمين الآخرين من خلال صندوق الدردشة. وفي حالة إساءة أحد اللاعبين إليك بأي شكل من الأشكال، يرجى التفضل بتقديم شكوى ضده وتجنب أي مواجهة مباشرة. سيؤدي عدم التزامك بما سبق إلى تحميلك المسؤولية عن أي إجراءات تتخذها"
        ,
        " باستخدام تطبيق قيدها فأنت توافق على عدم إنشاء أو تعديل أي موقع الكتروني ليكون مشابهاً لتطبيق قيدها"
        ,
        "إدارة قيدها لها الحق في اتخاذ أي عقوبة تراها مناسبة ضد أي لاعب يخالف القواعد واللوائح، وهذا يشمل، على سبيل المثال لا الحصر، حظر اللاعب بشكل مؤقت أو دائم من استخدام بعض ميزات التطبيق، أو وقف حساب المستخدم بشكل مؤقت أو دائم"
        ,
        "يمنع منعاً باتاً نشر أسماء لاعبين آخرين أو أي محتوى مؤذي أو مسيء أو أي مادة على أي صفحة عامة لقيدها لا علاقة لها بتطبيق قيدها"
        ,
        "يمنع الإعلان عن صفحات أو مواقع أو شركات أخرى على أي صفحة من الصفحات العامة لتطبيق قيدها",
        " باستخدام تطبيق قيدها فأنت توافق على عدم المشاركة في أي نشاط احتيالي على تطبيق قيدها بأي شكل من الأشكال"
        , "تحتفظ إدارة قيدها بحق تعديل أسعارها في أي وقت سواء برفعها أو خفضها"
        ,
        " نظرًا لطبيعة الخدمة التي يقدمها تطبيق قيدها، فإننا لا نقدم خدمة استرداد المبلغ على أي من المشتريات التي تم شراؤها من خلال نظامنا."
        , "تمتلك إدارة قيدها الحق في اتخاذ إجراءات قانونية ضد أي شخص يحاول الاحتيال على الموقع"
        ,
        " ستنتهي صلاحية جميع الاشتراكات و المشتريات تلقائيًا للحسابات غير النشطة لمدة عامين أو أكثر"
        ,
        "المملكة العربية السعودية هي بلد إقامتنا والقانون الحاكم هو القانون المحلي لدولة المملكة العربية السعودية. ولا يجوز الاستماع إلى جميع النزاعات الناشئة فيما يتعلق بذلك إلا من قبل محكمة مختصة في المملكة العربية السعودية"
    ]
}
</script>

<style scoped></style>